Repository: BravoBaldo/Translations
Catalog: FastLed/FastLED_OmegaT/tm/auto/tdd_ita-level2.tmx
Source language: en_us
Languages: it_it

source: -# Part 1: Just the basics
it_it: -# Parte 1: Solo le basi

source: //Assuming...
it_it: //Supponendo...

source: //GIVEN
it_it: //DATO

source: //THEN
it_it: //ALLORA

source: //WHEN
it_it: //QUANDO

source: //other code...
it_it: //altro codice...

source: //other code... }
it_it: //altro codice... }

source: //then the result should be...
it_it: //allora il risultato dovrebbe essere...

source: //we get the database object from outside the class:
it_it: //otteniamo l'oggetto database dall'esterno della classe:

source: //when this happens:
it_it: //quando ciò accade::

source: ^easytolearn: I don't know who said it first, I searched the web and found it in few places where none of the writers gave credit to anyone else for it, so I decided just to mention that I'm not the one that coined this phrase.
it_it: ^easytolearn: Non so chi l'ha detto per primo, ho cercato sul web e l'ho trovato in pochi posti in cui nessuno degli scrittori ha citato qualcun altro per questo, quindi ho deciso di menzionare semplicemente che non sono stato io a coniare questa frase.

source: ^notonlyunittests: By the way, TDD is not only about unit tests, which we will get to eventually.
it_it: ^notonlyunittests: A proposito, TDD non riguarda solo le unit test, a cui arriveremo alla fine.

source: Resharper test runner docked as a window in Visual Studio 2015 IDE
it_it: Il test runner Resharper [docked] come finestra in Visual Studio 2015 IDE

source: A Test Runner can take various forms, e.g. it can be a console application, a GUI application or a plugin for an IDE.
it_it: Un Test Runner può assumere varie forme, ad es. può essere un'applicazione console, un'applicazione GUI o un plug-in per un IDE.

source: A test framework allows us to specify and execute our tests.
it_it: Un framework di test ci consente di specificare ed eseguire i test.

source: A> ## Status: stable A> A> This chapter will mostly get bugfixes and cosmetic changes.
it_it: A> ## Status: stable A> A> Questo capitolo riceverà principalmente correzioni di bug e modifiche estetiche.

source: After changing our test to use AutoFixture, we arrive at the following:
it_it: Dopo aver modificato il nostro test per utilizzare AutoFixture, arriviamo a quanto segue:

source: After reading part 1, you will be able to effectively develop classes that have no dependencies on other classes (and on operating system resources) using TDD.
it_it: Dopo aver letto la parte 1, si sarà in grado di sviluppare in modo efficace classi che non hanno dipendenze da altre classi (e dalle risorse del sistema operativo) utilizzando il TDD.

source: And if we want it to throw an exception when anything is inserted:
it_it: E se vogliamo che sollevi un'eccezione quando viene inserito qualcosa:

source: And it is a skill that I can apply to many different technologies and languages, making me a better developer overall!
it_it: Ed è un'abilità che posso applicare a molte tecnologie e linguaggi diversi, rendendomi uno sviluppatore complessivamente migliore!

source: And we're done.
it_it: E abbiamo finito.

source: And while I think such exercises are very useful (in fact, I do a lot of them), I find an immense benefit in understanding the bigger picture of real-world TDD usage as well.
it_it: E anche se penso che tali esercizi siano molto utili (in effetti, ne faccio molti), trovo un immenso vantaggio anche nel comprendere il quadro più ampio sull'uso del TDD nel mondo reale.

source: Anonymous values generator
it_it: Generatore di valori anonimi

source: Another source of motivation may be imagining TDD as something it is not.
it_it: Un’altra fonte di motivazione potrebbe essere quella di immaginare il TDD come qualcosa che non è.

source: Any method added to the OrderDatabase interface must also be added to each of these fake classes.
it_it: Qualsiasi metodo aggiunto all'interfaccia OrderDatabase deve essere aggiunto anche a ciascuna di queste classi fake.

source: Are you determined to try it out and learn it?
it_it: Sei determinato a provarlo e ad impararlo?

source: As a step in that direction, we can extract the verification of the result into a reusable method -- after all, we will be adding division in a second, remember?
it_it: Come avanzamento in questa direzione, possiamo estrarre la verifica di result in un metodo riutilizzabile: dopo tutto, aggiungeremo la divisione in un secondo, ricordi?

source: As much as I hope you will read this book from cover to cover, I am aware that this doesn't always happen.
it_it: Per quanto spero che questo libro venga letto da cima a fondo, sono consapevole che questo non sempre accade.

source: As we don't know the real "why" of TDD, we may make up some reasons to practice test-first development, like "to ensure tests are written for everything".
it_it: Dato che non conosciamo il vero "perché" del TDD, potremmo inventare alcune ragioni per praticare lo sviluppo test-first, come "per garantire che i test siano scritti per tutto".

source: As you can see, our application produces a result of 21 for the multiplication of 3 by 7.
it_it: Come puoi vedere, l'applicazione produce un risultato pari a 21 per la moltiplicazione di 3 per 7.

source: As you see, we can easily write automated checks like this, using our primitive methods.
it_it: Come vedi, possiamo facilmente scrivere controlli automatizzati come questo, utilizzando i nostri metodi primitivi.

source: Aside from the creation of mock objects, such a framework provides an API to configure the mocks on how they behave when certain methods are called on them and allows us to inspect which calls they received.
it_it: A parte la creazione di oggetti mock, tale framework fornisce un'API per configurare i mock su come si comportano quando vengono chiamati determinati metodi e ci consente di controllare quali chiamate hanno ricevuto.

source: AssertTwoIntegersAreEqual(expected: 21, actual: result); } //extracted code: public static void AssertTwoIntegersAreEqual(
it_it: AssertTwoIntegersAreEqual(expected: 21, actual: result); } //codice estratto: public static void AssertTwoIntegersAreEqual(

source: At first, it isn't a big deal, but as soon as we have dozens of tests, an omission will become hard to notice.
it_it: All'inizio non è un grosso problema, ma non appena avremo dozzine di test, un'omissione diventerà difficile da notare.

source: At the beginning of the test, we open a connection to the database and clean all existing orders in it (more on that shortly), then create an order object, insert it into the database and query the database for all orders it contains.
it_it: All'inizio del test, apriamo una connessione al database e puliamo tutti gli ordini esistenti al suo interno (ne parleremo a breve), quindi creiamo un oggetto ordine, lo inseriamo nel database ed interroghiamo il database per tutti gli ordini in esso contenuti.

source: At the end, we assert that the order we tried to insert is among all orders in the database.
it_it: Alla fine affermiamo che l'ordine che abbiamo provato a inserire è tra tutti gli ordini presenti nel database.

source: AutoFixture has a lot of advanced features, but to keep things simple I like to hide its use behind a static class called Any.
it_it: AutoFixture ha molte funzionalità avanzate, ma per semplificare le cose mi piace nasconderne l'utilizzo dietro una classe statica chiamata Any.

source: Beating the game with all the warriors and unlocking all hidden bonuses, mini-games, etc. took about a day.
it_it: Completare il gioco con tutti i guerrieri e sbloccare tutti i bonus nascosti, i minigiochi, ecc. ha richiesto circa un giorno.

source: Besides, it handles any exception that may occur, by writing it into a log.
it_it: Inoltre, gestisce qualsiasi eccezione che possa verificarsi, scrivendola in un log.

source: But first, let's recap what we've got in our straightforward approach to writing automated tests and introduce some terminology that will help us understand how automated test frameworks solve our issues:
it_it: Ma prima, ricapitoliamo ciò che abbiamo nel nostro approccio diretto alla scrittura di test automatizzati e introduciamo una terminologia che ci aiuterà a capire come i framework di test automatizzati risolvono i nostri problemi:

source: But that is all like practicing Tekken by trying out each move on its own on a dummy opponent, without the context of real-world issues that make the fight challenging.
it_it: Ma è come esercitarsi in Tekken provando ogni mossa da sola su un avversario fittizio, senza il contesto di problemi del mondo reale che rendono il combattimento impegnativo.

source: But wait, we are programmers, right?
it_it: Ma aspetta, siamo programmatori, giusto?

source: By questioning your motivation, I'm not trying to discourage you from reading this book.
it_it: Mettendo in discussione la motivazione, non si sta cercando di scoraggiare la lettura di questo libro.

source: By the way, wouldn't it be nice if we didn't have to provide the anonymous objects ourselves, but could rely on another library to generate these for us?
it_it: A proposito, non sarebbe bello se non dovessimo fornire noi stessi gli oggetti anonimi, ma potessimo fare affidamento su un'altra libreria per generarli per noi?

source: Do I have to tell you that the second piece of advice worked better?
it_it: Devo dirti che il secondo consiglio ha funzionato meglio?

source: Do you?
it_it: Cosa fare?

source: Doesn't it trouble you that we fill the order object with so many values that are irrelevant to the test logic itself and that clutter the structure of the test with needless details?
it_it: Non ti disturba il fatto che riempiamo l'oggetto ordine con così tanti valori che sono irrilevanti per la logica del test stesso e che ingombrano la struttura del test con dettagli inutili?

source: Don't get me wrong, these statements might be partially true, but they miss a lot of the essence of TDD.
it_it: Non fraintendetemi, queste affermazioni potrebbero essere parzialmente vere, ma omettono gran parte dell'essenza di TDD.

source: Don't worry about it :-), I will make up for it in the coming chapters!
it_it: Non preoccuparti :-), mi rifarò nei prossimi capitoli!

source: Don't worry, you'll get used to it.
it_it: Non preoccuparti, ti abituerai.

source: Easy, don't panic -- remember the first time you tried to ride a bike -- you might have been far back then from knowing traffic regulations and following road signs, but that didn't keep you away, did it?
it_it: Tranquillo, niente panico: ricorda la prima volta che hai provato ad andare in bicicletta: avresti potuto essere molto indietro nel conoscere le norme del traffico e nel seguire i segnali stradali, ma questo non ti ha tenuto lontano, vero?

source: Especially since I plan to introduce the content slowly and gradually so that you can get a better explanation of some of the practices and techniques.
it_it: Soprattutto perché ho intenzione di introdurre i contenuti in modo lento e graduale in modo che si possa ottenere una spiegazione migliore di alcune pratiche e tecniche.

source: Even though, I accept the fact that the concept may be too difficult for you to grasp.
it_it: Anche se accetto il fatto che il concetto potrebbe essere troppo difficile da comprendere per te.

source: Even today, you can watch some of those old matches on youtube.
it_it: Ancora oggi si possono guardare alcune di quelle vecchie partite su YouTube.

source: Ever watched Karate Kid, either the old version or the new one?
it_it: Hai mai visto Karate Kid, sia la vecchia versione che quella nuova?

source: Every time we add a new test, we have to update the Main() method with a call to the new test.
it_it: Ogni volta che aggiungiamo un nuovo test, dobbiamo aggiornare il metodo Main() con una chiamata al nuovo test.

source: Everyone who wants to run this test will have to set up a special environment, e.g. a local database on their machine.
it_it: Tutti coloro che desiderano eseguire questo test dovranno impostare un ambiente speciale, ad es. un database locale sul proprio computer.

source: For example, here is a source code of a program that uses the Multiplication class, but in a slightly different way than the original application:
it_it: Ad esempio, ecco il codice sorgente di un programma che utilizza la classe Multiplication, ma in un modo leggermente diverso rispetto all'applicazione originale:

source: For example, objects of such classes may contain pre-programmed return values for some methods.
it_it: Ad esempio, gli oggetti di tali classi possono contenere valori di ritorno preprogrammati per alcuni metodi.

source: For now, I just want you to get familiar with the tools themselves and their syntax.
it_it: Per ora, voglio solo che tu acquisisca familiarità con gli strumenti stessi e la loro sintassi.

source: For these and other reasons, advanced automated test frameworks were created such as CppUnit (for C++), JUnit (for Java) or NUnit (C#).
it_it: Per questi e altri motivi sono stati creati framework di test automatizzati avanzati come CppUnit (per C++), JUnit (per Java) o NUnit (C#).

source: Given a test fails, it would be hard to navigate from the command line output to the corresponding line of the source in your IDE.
it_it: Se un test fallisce, sarebbe difficile passare dall'output della riga di comando alla riga corrispondente del sorgente nel tuo IDE.

source: Go on, download these tools, launch them, try to write something simple with them.
it_it: Vai avanti, scarica questi strumenti, avviali, prova a scrivere qualcosa di semplice con loro.

source: Hence the name AnonymousOrder().
it_it: Da qui il nome AnonymousOrder().

source: Here is an example of a test runner provided by a plugin for Visual Studio IDE called Resharper:
it_it: Ecco un esempio di un test runner fornito da un plug-in per l'IDE di Visual Studio chiamato Resharper:

source: Here's how we configure the fake order database to remember and yield the inserted order:
it_it: Ecco come configuriamo il database fake degli ordini per scrivere e restituire l'ordine inserito:

source: Here's the code for this class:
it_it: Ecco il codice per questa classe:

source: Honestly, I could dive right into the core techniques of TDD, but I feel this would be like putting you on a ring with a demanding opponent -- you would most probably be discouraged before gaining the necessary skills.
it_it: Onestamente, potrei tuffarmi direttamente nelle tecniche fondamentali del TDD, ma sento che sarebbe come metterti su un ring con un avversario esigente: molto probabilmente ti scoraggeresti prima di acquisire le abilità necessarie.

source: How do we setup the database in a state where it throws an exception?
it_it: Come configuriamo il database in uno stato in cui genera un'eccezione?

source: How many times would we have to invoke the application manually to make sure every operation works correctly?
it_it: Quante volte dovremmo richiamare manualmente l'applicazione per verificare che ogni operazione funzioni correttamente?

source: How?
it_it: Come?

source: However, this approach has some disadvantages:
it_it: Tuttavia, questo approccio presenta alcuni svantaggi:

source: I also believe that this is true not only for me, but for many other software developers.
it_it: Credo anche che questo sia vero non solo per me, ma per molti altri sviluppatori di software.

source: I am honored and happy that you chose this one, no matter if this is your first book on TDD or one of many you have opened up in your learning endeavors.
it_it: Sono onorato e felice che sia stato scelto questo, non importa se questo sia il primo libro sul TDD o uno dei tanti che letti per i propri studi.

source: I believe that TDD is a major improvement over other software development methodologies that I have used to deliver quality software.
it_it: Credo che il TDD rappresenti un notevole miglioramento rispetto ad altre metodologie di sviluppo software utilizzate per fornire software di qualità.

source: I could side-step to evade enemy's attacks and, most of all, I could kick another fighter up in the air where they could not block my attacks and I was able to land some nice attacks on them before they fell.
it_it: Potevo fare un passo laterale per eludere gli attacchi del nemico e, soprattutto, potevo calciare un altro combattente in aria dove non potevano bloccare i miei attacchi e potevo sferrare alcuni begli attacchi contro di loro prima che cadessero.

source: I find TDD very exciting and it makes me excited about writing code as well.
it_it: Trovo che il TDD sia molto eccitante e mi renda entusiasta anche di scrivere codice.

source: I have a new set of techniques that makes my coding career challenging again!
it_it: Ho una nuova serie di tecniche che rendono di nuovo impegnativa la mia carriera di programmatore!

source: I have heard such disappointed practitioners saying "I don't need TDD, because I need tests that give me confidence on a broader scope" or "Why do I need unit tests^notonlyunittests when I already have integration tests, smoke tests, sanity tests, exploration tests, etc...?" Many times, I have seen TDD abandoned before it is even understood.
it_it: Ho sentito professionisti delusi dire "Non ho bisogno del TDD, perché ho bisogno di test che mi diano fiducia in un ambito più ampio" o "Perché ho bisogno di unit test^notonlyunittests quando ho già i test di integrazione, gli smoke test, sanity test, exploration test, ecc...?" Molte volte ho visto il TDD abbandonato prima ancora che fosse compreso.

source: I have to respect you for deciding to pick up a book, rather than building your understanding of TDD on the foundation of urban legends and your imagination.
it_it: C'è da rispettare chi decide di prendere in mano un libro, piuttosto che basare la comprensione del TDD sulle leggende metropolitane e la propria immaginazione.

source: I would be hesitant to answer "yes".
it_it: Sarei titubante nel rispondere "sì".

source: I'll give you a quick example of a mocking framework in action now and defer further explanation of their purpose to later chapters, as the full description of mocks and their place in TDD is not so easy to convey.
it_it: Ti darò un rapido esempio di un framework di mocking in azione ora e rimanderò ulteriori spiegazioni del loro scopo ai capitoli successivi, poiché la descrizione completa dei mock e il loro posto in TDD non è così facile da trasmettere.

source: I'm writing this book because I'm an enthusiast of Test-Driven Development (TDD).
it_it: Sto scrivendo questo libro perché sono un entusiasta del Test-Driven Development (TDD).

source: If TDD does not bring the benefits we imagine it might bring, disappointment may creep in.
it_it: Se il TDD non porta i benefici che immaginiamo possa portare, la delusione potrebbe insinuarsi.

source: If this chapter leaves you with insufficient justification for their use, don't worry -- we will dive into the philosophy behind them in the coming chapters.
it_it: Se questo capitolo ti lascia con una giustificazione insufficiente per il loro utilizzo, non preoccuparti: approfondiremo la filosofia che sta dietro ad essi nei prossimi capitoli.

source: If we did that, the first test would look like this:
it_it: Se lo facessimo, il primo test sarebbe simile a questo:

source: If we don't clean it up before executing the logic of this test, the database may already contain the item we are trying to add, e.g. from previous executions of this test.
it_it: Se non lo ripuliamo prima di eseguire la logica di questo test, il database potrebbe già contenere l'elemento che stiamo tentando di aggiungere, ad es. dalle precedenti esecuzioni di questo test.

source: If we forget to add such a call, the test will never be run.
it_it: Se dimentichiamo di aggiungere tale chiamata, il test non verrà mai eseguito.

source: If you are still determined to learn TDD with me by reading this book, which I hope you are, then let's get to work!
it_it: Se sei ancora determinato a imparare il TDD con me leggendo questo libro, cosa che spero tu faccia, allora mettiamoci al lavoro!

source: If you're not, hey, I heard the new series of Game of Thrones is on TV, why don't you check it out instead?
it_it: Se non lo sei, ehi, ho sentito che la nuova serie di Game of Thrones è in TV, perché non dai un'occhiata invece?

source: If, while reading this section, you find yourself lost, please skip it.
it_it: Se, mentre leggi questa sezione, ti ritrovi perso, saltala.

source: Imagine your system consists of more than one application -- you would have some problems trying to gather summary results for all of the applications that your system consists of.
it_it: Immagina che il tuo sistema sia costituito da più di un'applicazione: avresti alcuni problemi nel tentare di raccogliere risultati riassuntivi per tutte le applicazioni di cui è composto il tuo sistema.

source: In my professional life, I haven't seen the adoption rate to be high enough to justify the claim that TDD is now mainstream.
it_it: Nella mia vita professionale, non ho mai visto un tasso di adozione abbastanza alto da giustificare l'affermazione che il TDD sia ormai la pratica principale [mainstream].

source: In other words, I will give you a brief tour of the three tools we will use throughout this book.
it_it: In altre parole, offrirò un breve tour dei tre strumenti che utilizzeremo in questo libro.

source: In terms of design, most of the examples will be about methods of a single object being exercised.
it_it: In termini di progettazione, la maggior parte degli esempi riguarderà i metodi di test di un singolo oggetto.

source: In the next chapters, we'll see many different methods from the Any type, plus the full explanation of the philosophy behind it.
it_it: Nei prossimi capitoli vedremo molti metodi diversi dal tipo Any, oltre alla spiegazione completa della filosofia che sta dietro ad esso.

source: In this chapter, I tried to provoke you to rethink your attitude and motivation.
it_it: In questo capitolo ho cercato di provocarti a riconsiderare il tuo atteggiamento e la tua motivazione.

source: In this chapter, I will oversimplify some things just to get you up and running without getting into the philosophy of TDD yet (think: physics lessons in primary school).
it_it: In questo capitolo semplificherò eccessivamente alcune cose solo per farti iniziare a lavorare senza entrare ancora nella filosofia del TDD (pensa alle lezioni di fisica nella scuola elementare).

source: In this situation we can leave the MySqlOrderDatabase out of the test and instead create another, fake implementation of the OrderDatabase that acts as if it was a connection to a database but does not write to a real database at all -- it only stores the inserted records in a list in memory.
it_it: In questa situazione possiamo lasciare MySqlOrderDatabase fuori dal test e creare invece un'altra falsa implementazione di OrderDatabase che si comporta come se fosse una connessione a un database ma non scrive su un database reale: memorizza solo i record inseriti in un elenco in memoria.

source: In this test, we use an instance of a Fixture class (which is a part of AutoFixture) to create anonymous values for us via a method called Create().
it_it: In questo test, utilizziamo un'istanza di una classe Fixture (che fa parte di AutoFixture) per creare valori anonimi per noi tramite un metodo chiamato Create().

source: Inside this new test, we can reuse the AssertTwoIntegersAreEqual() method, since the check for division would also be about comparing two integer values.
it_it: All'interno di questo nuovo test, possiamo riutilizzare il metodo AssertTwoIntegersAreEqual(), poiché il controllo della divisione riguarderebbe anche il confronto di due valori interi.
